#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Mon Jan  3 01:36:44 2022
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 2 -waveform {0 1} -name vsysclk 
create_clock -period 3 -waveform {0 1.5} -name sysclk [get_ports clk]
set_false_path -from [get_ports rst]
group_path -name I2R -from [list [get_ports {tempSens[0]}] [get_ports {tempSens[1]}] [get_ports {tempSens[2]}] [get_ports {tempSens[3]}] [get_ports {tempSens[4]}] [get_ports {tempSens[5]}] [get_ports {tempSens[6]}] [get_ports {tempSens[7]}] [get_ports fireSens] [get_ports WindowSens] [get_ports rearSens] [get_ports frontSens] [get_ports clk] [get_ports rst]]
group_path -name I2O -from [list [get_ports {tempSens[0]}] [get_ports {tempSens[1]}] [get_ports {tempSens[2]}] [get_ports {tempSens[3]}] [get_ports {tempSens[4]}] [get_ports {tempSens[5]}] [get_ports {tempSens[6]}] [get_ports {tempSens[7]}] [get_ports fireSens] [get_ports WindowSens] [get_ports rearSens] [get_ports frontSens] [get_ports clk] [get_ports rst]]  -to [list [get_ports heater] [get_ports cooler] [get_ports buzz] [get_ports windowOut] [get_ports rearOut] [get_ports frontOut]]
group_path -name R2O -to [list [get_ports heater] [get_ports cooler] [get_ports buzz] [get_ports windowOut] [get_ports rearOut] [get_ports frontOut]]
set_load 10 [get_ports frontOut]
set_load 10 [get_ports rearOut]
set_load 10 [get_ports windowOut]
set_load 10 [get_ports buzz]
set_load 10 [get_ports cooler]
set_load 10 [get_ports heater]
set_input_transition 0.1 [get_ports rst]
set_input_transition 0.1 [get_ports clk]
set_input_transition 0.1 [get_ports frontSens]
set_input_transition 0.1 [get_ports rearSens]
set_input_transition 0.1 [get_ports WindowSens]
set_input_transition 0.1 [get_ports fireSens]
set_input_transition 0.1 [get_ports {tempSens[7]}]
set_input_transition 0.1 [get_ports {tempSens[6]}]
set_input_transition 0.1 [get_ports {tempSens[5]}]
set_input_transition 0.1 [get_ports {tempSens[4]}]
set_input_transition 0.1 [get_ports {tempSens[3]}]
set_input_transition 0.1 [get_ports {tempSens[2]}]
set_input_transition 0.1 [get_ports {tempSens[1]}]
set_input_transition 0.1 [get_ports {tempSens[0]}]
set_input_delay 0.7 [get_ports rst]
set_input_delay 0.7 [get_ports clk]
set_input_delay 0.7 [get_ports frontSens]
set_input_delay 0.7 [get_ports rearSens]
set_input_delay 0.7 [get_ports WindowSens]
set_input_delay 0.7 [get_ports fireSens]
set_input_delay 0.7 [get_ports {tempSens[7]}]
set_input_delay 0.7 [get_ports {tempSens[6]}]
set_input_delay 0.7 [get_ports {tempSens[5]}]
set_input_delay 0.7 [get_ports {tempSens[4]}]
set_input_delay 0.7 [get_ports {tempSens[3]}]
set_input_delay 0.7 [get_ports {tempSens[2]}]
set_input_delay 0.7 [get_ports {tempSens[1]}]
set_input_delay 0.7 [get_ports {tempSens[0]}]
set_output_delay 0.6 -clock vsysclk [get_ports frontOut]
set_output_delay 0.6 -clock vsysclk [get_ports rearOut]
set_output_delay 0.6 -clock vsysclk [get_ports windowOut]
set_output_delay 0.6 -clock vsysclk [get_ports buzz]
set_output_delay 0.6 -clock vsysclk [get_ports cooler]
set_output_delay 0.6 -clock vsysclk [get_ports heater]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
